//#1
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

//const num = Number(prompt('Введіть число'));
//alert(num === 10 ? 'Вірно' : 'Невірно');

//#2
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

//const min = Math.floor(Math.random() * (59 - 0) + 0);
//console.log(min);
//let quarter;

//if (min >= 0 && min < 15) {
//  quarter = 'першу';
//} else if (min >= 15 && min < 30) {
// quarter = 'другу';
//} else if (min >= 30 && min < 45) {
//  quarter = 'третю';
//} else {
//  quarter = 'четверту';
//}

//alert(`${min} входить в ${quarter} чверть`);

//#3
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної resu
// Значення змінної result виведіть в консоль.

/*const num = prompt('Введіть число від 1 до 4');

let result;
switch (num) {
  case '1':
    result = 'зима';
    break;
  case '2':
    result = 'весна';
    break;
  case '3':
    result = 'літо';
    break;
  case '4':
    result = 'осінь';
    break;
  default:
    result = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно';
}
console.log('result', result);*/

//#4
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

/*function min(a, b) {
  if (typeof a !== 'number' || typeof b !== 'number') {
    return 'Not a number!';
  }

  return a < b ? a : b;
}*/

//#5
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
/*let number = 0;
while (number <= 20) {
  console.log(number);
  number += 1;
}*/

//#6
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

/*function getNumbers(min, max) {
  let sum = 0;
  for (let i = max; i >= min; i--) {
    console.log(i);
    if (i % 2 === 0) {
      sum += i;
    }
  }

  return sum;
  
}*/

//#7
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.
/*function fizzBuzz(num) {
  for (let i = 1; i <= num; i++) {
    if (i % 3 === 0 && i % 5 === 0) {
      console.log('fizzbuzz');
    } else if (i % 3 === 0) {
      console.log('fizz');
    } else if (i % 5 === 0) {
      console.log('buzz');
    } else {
      console.log(i);
    }
  }
}
console.log(fizzBuzz(20));*/

//#8
// Потрібно підрахувати кількість парних чисел у заданому діапазоні
// "Кількість парних чисел Count"

/*const start = 1;
const end = 20;

let count = 0;

for (let i = start; i <= end; i++) {
  if (i % 2 === 0) {
    count++;
  }
}

console.log('Кількість парних чисел:', count);*/

//#9
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):

/*const totalMinutes = Number(prompt('Введіть кількість хвилин:'));
const hours = Math.floor(totalMinutes / 60);
const minutes = totalMinutes % 60;
const formatTime = `${String(hours).padStart(2, '0')}:${String(
  minutes
).padStart(2, '0')}`;

console.log(formatTime);*/
